/*
(i) Код попадает в итоговый файл,
только когда вызвана функция,
например flsFunctions.spollers();
Или когда импортирован весь файл,
например import "files/script.js";
Неиспользуемый (не вызванный)
код в итоговый файл не попадает.

Если мы хотим добавить модуль
следует его расскоментировать
*/

// Подключение основного файла стилей
import "../scss/style.scss";

//=== Плагины ============================================================================================================================================================================================================================================================================================================

/* Динамический адаптив */
//import "./libs/dynamic_adapt.js";

/* Форматирование чисел */
//import './libs/wNumb.min.js';

//==== Основные модули ========================================================================================================================================================================================================================================================
import * as flsFunctions from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
flsFunctions.isWebp();
/* Добавление класса touch для HTML если браузер мобильный */
flsFunctions.addTouchClass();
/* Добавление loaded для HTML после полной загрузки страницы */
flsFunctions.addLoadedClass();
/* Модуль для работы с меню (Бургер) */
flsFunctions.menuOpen();

/*
Модуль работы со спойлерами
Документация:
Сниппет (HTML): spollers
*/
//flsFunctions.spollers();

/*
Модуль работы с табами
Документация:
Сниппет (HTML): tabs
*/
// Для подключения в шаблон раскомментировать
//flsFunctions.tabs();

//==== Работа с формами ========================================================================================================================================================================================================================================================
import * as flsForms from "./files/forms.js";

/* Основной Модуль */
//flsForms.formValidateAndSubmit();

/* Модуль формы "колличество" */
//flsForms.formQuantity();

/* Модуль формы "показать пароль" */
//flsForms.formViewpass();

/* Модуль работы с select */
//flsForms.formSelect();

/* Модуль звездного рейтинга */
//flsForms.formRating();

//==== Модуль работы с ползунком (noUiSlider) ===================================================================================================================================================================================================================================================================================
/*
Подключение плагина ползунка noUiSlider и настройка выполняется в файле js/files/nouislider.js
Документация по работе в шаблоне:
Документация плагина:
*/
// Для подключения в шаблон раскомментировать
//import "./files/nouislider.js";

//==== Модуль работы с попапами (hystmodal) ===================================================================================================================================================================================================================================================================================
/*
Подключение плагина hystModal и настройка выполняется в файле js/files/popups.js
Документация по работе в шаблоне:
Документация плагина: https://addmorescripts.github.io/hystModal/index_ru.html
Сниппет: 
*/
// Для подключения в шаблон раскомментировать
//import "./files/popups.js";

//==== Модуль работы с подсказками (tippy) ====================================================================================================================================================================================================================================================================================
/*
Подключение плагина Tippy.js и настройка выполняется в файле js/files/tippy.js
Документация по работе в шаблоне:
Документация плагина: https://atomiks.github.io/tippyjs/
Сниппет: tip (добавляет атрибут с подсказкой для html тега)
*/
// Для подключения в шаблон раскомментировать
//import "./files/tippy.js";

//==== Работа со слайдером Swiper ========================================================================================================================================================================================================================================================
/*
Настройка подключения плагина слайдера Swiper и новых слайдеров выполняется в файле js/files/sliders.js
Документация по работе в шаблоне:
Документация плагина: https://swiperjs.com/
Сниппет(HTML): swiper
*/
//Для подключения в шаблон раскомментировать
//import "./files/sliders.js";

//==== Прочее ========================================================================================================================================================================================================================================================
/* Подключаем файл со своим кодом */
import "./files/script.js";
//============================================================================================================================================================================================================================================